nxp-zephyr/hal_nxp/mcux/mcux-sdk/devices/MCXW727C/drivers/fsl_i3c.c
            /* Ready to handle next device. */
            mctrlDone = false;
            rxSize    = 0;
        }
        else
        {
            /* Intentional empty */
        }
    } while ((status & (uint32_t)kI3C_MasterCompleteFlag) != (uint32_t)kI3C_MasterCompleteFlag);

    /* Master stops DAA if slave device number exceeds the prepared address number. */
    if (result == kStatus_I3C_SlaveCountExceed)
    {
        /* Send the STOP signal */
        base->MCTRL = (base->MCTRL & ~(I3C_MCTRL_REQUEST_MASK | I3C_MCTRL_DIR_MASK | I3C_MCTRL_RDTERM_MASK)) |
                      I3C_MCTRL_REQUEST(kI3C_RequestEmitStop);
    }

    /* Set back initial baud rate after DAA is over. */
    if (daaBaudRate != NULL)
    {
        base->MCONFIG = masterConfig;
    }

    /* Clear all flags. */
    I3C_MasterClearErrorStatusFlags(base, (uint32_t)kMasterErrorFlags);
    I3C_MasterClearStatusFlags(base, (uint32_t)kMasterClearFlags);

    /* Enable I3C IRQ sources while we configure stuff. */
    I3C_MasterEnableInterrupts(base, enabledInts);

    return result;
}

/*!
 * brief Get device information list after DAA process is done.
 *
 * param base The I3C peripheral base address.
 * param[out] count The pointer to store the available device count.
 * return Pointer to the i3c_device_info_t array.
 */
i3c_device_info_t *I3C_MasterGetDeviceListAfterDAA(I3C_Type *base, uint8_t *count)
{
    assert(NULL != count);

    *count = usedDevCount;

    return devList;
}

/*!
 * @brief introduce function I3C_MasterClearFlagsAndEnableIRQ.
 *
 * This function was used of Clear all flags and Enable I3C IRQ sources for @param *base.
 *
 * @param base The I3C peripheral base address.
 */
static void I3C_MasterClearFlagsAndEnableIRQ(I3C_Type *base)
{
    /* Clear all flags. */
    I3C_MasterClearStatusFlags(base, (uint32_t)kMasterClearFlags);
    /* Enable I3C IRQ sources. */
    I3C_MasterEnableInterrupts(base, (uint32_t)kMasterIrqFlags);
}

/*!
 * @brief introduce function I3C_MasterTransferNoStartFlag.
 *
 * This function was used of Check if device request wins arbitration.
 *
 * @param base The I3C peripheral base address.
 * @param transfer Pointer to the transfer structure.
 * @retval #true if the device wins arbitration.
 * @retval #false if the device not wins arbitration.
 */
static bool I3C_MasterTransferNoStartFlag(I3C_Type *base, i3c_master_transfer_t *transfer)
{
    /* Wait tx fifo empty. */
    size_t txCount = 0xFFUL;

    while (txCount != 0U)
    {
        I3C_MasterGetFifoCounts(base, NULL, &txCount);
    }

    /* Check if device request wins arbitration. */
    if (0UL != (I3C_MasterGetStatusFlags(base) & (uint32_t)kI3C_MasterArbitrationWonFlag))
    {
        I3C_MasterClearFlagsAndEnableIRQ(base);
        return true;
    }
    return false;
}

/*!
 * brief Performs a master polling transfer on the I2C/I3C bus.
 *
 * note The API does not return until the transfer succeeds or fails due
 * to error happens during transfer.
 *
 * param base The I3C peripheral base address.
 * param transfer Pointer to the transfer structure.
 * retval #kStatus_Success Data was received successfully.
 * retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 * retval #kStatus_I3C_Nak The slave device sent a NAK in response to a byte.
 * retval #kStatus_I3C_FifoError FIFO under run or overrun.
 * retval #kStatus_I3C_ArbitrationLost Arbitration lost error.
 * retval #kStatus_I3C_PinLowTimeout SCL or SDA were held low longer than the timeout.
 */
status_t I3C_MasterTransferBlocking(I3C_Type *base, i3c_master_transfer_t *transfer)
{
    assert(NULL != transfer);
    assert(transfer->subaddressSize <= sizeof(transfer->subaddress));

    status_t result                = kStatus_Success;
    i3c_direction_t direction      = transfer->direction;
    i3c_master_state_t masterState = I3C_MasterGetState(base);
    bool checkDdrState             = false;
    i3c_rx_term_ops_t rxTermOps;

    /* Return an error if the bus is already in use not by us. */
    checkDdrState = (transfer->busType == kI3C_TypeI3CDdr) ? (masterState != kI3C_MasterStateDdr) : true;

    if ((masterState != kI3C_MasterStateIdle) && (masterState != kI3C_MasterStateNormAct) && checkDdrState)
    {
        return kStatus_I3C_Busy;
    }

    /* Clear all flags. */
    I3C_MasterClearStatusFlags(base, (uint32_t)kMasterClearFlags);
    /* Reset fifos. These flags clear automatically. */
    base->MDATACTRL |= I3C_MDATACTRL_FLUSHTB_MASK | I3C_MDATACTRL_FLUSHFB_MASK;

    /* Disable I3C IRQ sources while we configure stuff. */
    I3C_MasterDisableInterrupts(base, (uint32_t)kMasterIrqFlags);

    if (transfer->busType != kI3C_TypeI3CDdr)
    {
        direction = (0UL != transfer->subaddressSize) ? kI3C_Write : transfer->direction;
    }

    /* True: Set Rx termination bytes at start point, False: Set Rx termination one bytes in advance. */
    if ((transfer->flags & (uint32_t)kI3C_TransferDisableRxTermFlag) != 0U)
    {
        rxTermOps = kI3C_RxTermDisable;
    }
    else if (transfer->dataSize <= 255U)
    {
        rxTermOps = kI3C_RxAutoTerm;
    }
    else
    {
        rxTermOps = kI3C_RxTermLastByte;
    }

    if (0UL != (transfer->flags & (uint32_t)kI3C_TransferStartWithBroadcastAddr))
    {
        if (0UL != (transfer->flags & (uint32_t)kI3C_TransferNoStartFlag))
        {
            return kStatus_InvalidArgument;
        }

        if (0UL != (transfer->flags & (uint32_t)kI3C_TransferRepeatedStartFlag))
        {
            return kStatus_InvalidArgument;
        }

        /* Issue 0x7E as start. */
        result = I3C_MasterStart(base, transfer->busType, 0x7E, kI3C_Write);
        if (result != kStatus_Success)
        {
            return result;
        }

        result = I3C_MasterWaitForCtrlDone(base, false);
        if (result != kStatus_Success)
        {
            return result;
        }
    }

    if (0UL == (transfer->flags & (uint32_t)kI3C_TransferNoStartFlag))
    {
        if ((direction == kI3C_Read) && (rxTermOps == kI3C_RxAutoTerm))
        {
            result = I3C_MasterStartWithRxSize(base, transfer->busType, transfer->slaveAddress, direction,
                                               (uint8_t)transfer->dataSize);
        }
        else
        {
            result = I3C_MasterStart(base, transfer->busType, transfer->slaveAddress, direction);
        }
        if (result != kStatus_Success)
        {
            return result;
        }

